sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c


#include "stdint.h"
#include "stdlib.h"
#include "uart.h"
#include "misc.h"
#include "lcd.h"
#include "delay.h"
#include "gsm.h"
#include "system_LPC17xx.h"
#include "LPC17xx.h"
#include "stdio.h"
#include "syscalls.h"
#include "string.h"
#include "config.h"
#include "jsmn.h"

Modem_Type_t modem;

/** @brief 
 *  @param 
 *  @return 
 */
void gsm_allocate_mem(void)
{
	/* allocate memory */
	modem.ipstate = (char *) malloc(32);
	modem.apn = (char *) malloc(64);
	modem.opr = (char *) malloc(64);
	modem.ip = (char *) malloc(32);
	modem.httpdata = (char *) malloc(1024);
}

int8_t process_response(char * ptr, uint16_t len)
{
	// 
	if(isblankstr(uart3_fifo.line, len))
	{
		return __LINE_BLANK;
	}

	// Check for data
	else if(memchr(ptr, '+', len) && memchr(ptr, ':', len))
	{
		if(strstr(uart3_fifo.line, "+CPIN") || strstr(uart3_fifo.line, "+CFUN"))
		{
			return __LINE_START_OTHER;
		}
		return __LINE_DATA;
	}

	// Check for errors
	else if(strstr(ptr,"ERROR") != NULL)
	{
		return __LINE_ERROR;
	}

	// otherwise 
	else
	{
		if(strstr(uart3_fifo.line, "RDY"))
		{
			return __LINE_START_RDY;
		}
		else if(strstr(uart3_fifo.line, "Call Ready"))
		{
			return __LINE_START_CRDY;
		}
		return __LINE_OTHER;
	}
}

/** @brief 		Send AT to modem and checks for OK
 *  @param 		int8_t
 *  @return 	void
 */
int8_t gsm_ping_modem(void)
{
	uint16_t len, resp;

	/* write AT to modem */
	modem_out("AT\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	// read 2nd line it should contain 'OK'
	len = modem_readline();

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		if(strstr(uart3_fifo.line, "OK"))
		{
			return 1;
		}
		else
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}
	else
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* never execute */
	return 0;
}


int8_t gsm_get_ipstatus(void)
{
	uint16_t len, resp;

	/* write AT+CIPSTATUS to modem */
	modem_out("AT+CIPSTATUS\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should contain 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		if(strstr(uart3_fifo.line, "OK") == NULL)
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}
	else
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	// read 3rd line it should be blank
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	

	// read 4th line it should be blank
	len = uart3_readline();
	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 4th line\r\n");
		debug_out("processing line, expected is STATE: <status>\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	// check whether __OTHER line
	if(resp == __LINE_OTHER)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __OTHER line\r\n");
		#endif

		// FIXME: sscanf is not working it is not implemented for strings in minilib-c see stdio.c
		char * __index = memchr(uart3_fifo.line, ':', len);

		// parse STATE: <status> string, i.e we need status string
		if(__index)
		{
			uint8_t __indexlen 	= strlen(__index);
			// +2 for removing :<space>
			memcpy(modem.ipstate, (__index + 2), (__indexlen - 2));

			// remove <cr><lf>
			/*modem.ipstate[__indexlen - 3] 	= '\0';
			modem.ipstate[__indexlen - 4]	= '\0';*/

			#if APPLICATION_LOG_LEVEL == 1
				debug_out("ip state parse success\r\n");
				debug_out("STATUS: ");
				debug_out(modem.ipstate);
				debug_out("\r\n");
			#endif

			// SUCCESS
			flag = 1;
		}
		else
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("ip status parse failed\r\n");
				sprintf(debug_buff, "line: %s", uart3_fifo.line);
				debug_out(debug_buff);
				debug_out("\r\n");
			#endif
		}
	}

	// else display error
	// TODO: retry before going to further step
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __OTHER, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}
	// FAIL
	return flag;
}

uint8_t gsm_update_rssi(void)
{
	uint16_t len, resp;
	uint8_t flag = 0;

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("sending 'AT+CSQ'\r\n");
	#endif

	// send 'AT+CSQ'
	modem_out("AT+CSQ\r");

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("'AT+CSQ' sent\r\n");
		debug_out("reading 1st line\r\n");
	#endif

	// Expected first line is blank
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 1st line\r\n");
		debug_out("processing line, expected is blank\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp == __LINE_BLANK)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __BLANK line\r\n");
		#endif
	}

	// else display error
	// TODO: retry before going to further step
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __BLANK, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}


	#if APPLICATION_LOG_LEVEL == 1
		debug_out("reading 2nd line\r\n");
	#endif

	// read 2nd line
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 2nd line\r\n");
		debug_out("processing line, expected is __OTHER line\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_DATA)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __DATA line\r\n");
		#endif
		
		char * __next;
		char * __index = index(uart3_fifo.line, ':');

		__index += 2;

		modem.rssi = strtol(__index, &__next, 10);

		// FIXME: Hanging
		/*if(sscanf(uart3_fifo.line, "+CSQ: %d",&rssi))
			modem.rssi = rssi;*/
	}

	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __DATA, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}

