sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 1st line\r\n");
		debug_out("processing line, expected is blank\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp == __LINE_BLANK)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __BLANK line\r\n");
		#endif
	}

	// else display error
	// TODO: retry before going to further step
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __BLANK, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}


	#if APPLICATION_LOG_LEVEL == 1
		debug_out("reading 2nd line\r\n");
	#endif

	// read 2nd line
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 2nd line\r\n");
		debug_out("processing line, expected is __OTHER line\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __OTHER line\r\n");
			debug_out("searching for 'OK'\r\n");
		#endif
		if(strstr(uart3_fifo.line, "OK"))
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("found ok\r\n");
				debug_out("'AT' 'OK' success\r\n");
			#endif
			// SUCCESS
			flag = 1;
		}
		else
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("error expected is __OTHER, but got something else\r\n");
				sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
				debug_out(debug_buff);
			#endif
		}
	}
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("'OK' not found\r\n");
			sprintf(debug_buff, "line: %s", uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}
	// FAIL
	return flag;
}

uint8_t gsm_get_ipaddr(void)
{
	uint16_t len, resp;
	uint8_t flag = 0;

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("sending 'AT+CIFSR'\r\n");
	#endif

	// send 'AT'
	modem_out("AT+CIFSR\r");

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("'AT+CIFSR' sent\r\n");
		debug_out("reading 1st line\r\n");
	#endif

	// Expected first line is blank
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 1st line\r\n");
		debug_out("processing line, expected is blank\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp == __LINE_BLANK)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __BLANK line\r\n");
		#endif
	}

	// else display error
	// TODO: retry before going to further step
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __BLANK, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}


	#if APPLICATION_LOG_LEVEL == 1
		debug_out("reading 2nd line\r\n");
	#endif

	// read 2nd line
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 2nd line\r\n");
		debug_out("processing line, expected is __OTHER line\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __OTHER line\r\n");
			debug_out("searching for ip\r\n");
		#endif
		if(strstr(uart3_fifo.line, "ERROR"))
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("ip not found error\r\n");
			#endif	
		}
		else
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("ip found error\r\n");
			#endif
			strcpy(modem.ip, uart3_fifo.line);
			flag = 1;
		}

	}
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __OTHER, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}
	// FAIL
	return flag;
}

uint8_t gsm_tcp_close(void)
{
	uint16_t len, resp;
	uint8_t flag = 0;

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("sending 'AT+CIPCLOSE'\r\n");
	#endif

	// send 'AT'
	modem_out("AT+CIPCLOSE\r");

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("'AT+CIPCLOSE' sent\r\n");
		debug_out("reading 1st line\r\n");
	#endif

	// Expected first line is blank
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 1st line\r\n");
		debug_out("processing line, expected is blank\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp == __LINE_BLANK)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __BLANK line\r\n");
		#endif
	}

	// else display error
	// TODO: retry before going to further step
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __BLANK, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}


	#if APPLICATION_LOG_LEVEL == 1
		debug_out("reading 2nd line\r\n");
	#endif

	// read 2nd line
	len = uart3_readline();

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("read 2nd line\r\n");
		debug_out("processing line, expected is __OTHER line\r\n");
	#endif

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("got __OTHER line\r\n");
			debug_out("searching for ip\r\n");
		#endif
		if(strstr(uart3_fifo.line, "ERROR"))
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("line contain 'ERROR'\r\n");
			#endif	
		}
		else if(strstr(uart3_fifo.line, "CLOSE OK"))
		{
			#if APPLICATION_LOG_LEVEL == 1
				debug_out("line contain 'CLOSE OK'\r\n");
			#endif
			flag = 1;
		}

	}
	else
	{
		#if APPLICATION_LOG_LEVEL == 1
			debug_out("error expected is __OTHER, but got something else\r\n");
			sprintf(debug_buff, "resp: %d, line: %s", resp, uart3_fifo.line);
			debug_out(debug_buff);
		#endif
	}
	// FAIL
	return flag;
}

uint8_t gsm_tcp_start(char * host, char * port)
{
	uint16_t len, resp;
	uint8_t flag = 0;

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("sending 'AT+CIPSTART'\r\n");
	#endif

	// send 'AT'
	modem_out("AT+CIPSTART=\"TCP\",\"");
	modem_out(host);
	modem_out("\",");
	modem_out(port);
	modem_out("\r");

	#if APPLICATION_LOG_LEVEL == 1
		debug_out("'AT+CIPSTART' sent\r\n");
		debug_out("reading 1st line\r\n");
	#endif

	// Expected first line is blank
	len = uart3_readline();
	//debug_out(uart3_fifo.line);

