sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
			// Read 2nd line
			len = uart3_readline();
			debug_out(uart3_fifo.line);

			resp = process_response(uart3_fifo.line,len);

			if(resp == __LINE_OTHER)
			{
				if(strstr(uart3_fifo.line, "SEND OK"))
				{
					flag = 1;
				}
			}
		}
		else
		{
			// ERROR
			return flag;
		}
	}
	else
	{
		// ERROR
		return flag;
	}
	return flag;
}

uint8_t gsm_http_put(char * host, char * path, char * dat)
{
	uint8_t state, resp;
	uint8_t flag = 0;
	uint16_t len;
	char buff[10];

	state = gsm_tcp_start(host, "80");
	if(state)
	{
		debug_out("tcp started\r\n");
		state = gsm_tcp_send();
		if(state)
		{

			debug_out("Send '>'\r\n");

			// 1st line
			modem_out("PUT ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");

			// 2nd line
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");

			// 3rd line 
			modem_out("Content-Type: application/json\r\n");

			// 4th line 
			modem_out("Accept: application/json\r\n");

			// 5th line
			modem_out("Content-Length: ");
			sprintf(buff, "%d", strlen(dat));
			modem_out(buff);

			modem_out("\r\n\r\n");
			modem_out(dat);
			modem_out("\r\n\r\n");

			// Send
			uart3_putc(0x1A);

			debug_out("sent\r\n");

			// Read 1st line
			len = uart3_readline();
			debug_out(uart3_fifo.line);

			resp = process_response(uart3_fifo.line,len);

			if(resp == __LINE_BLANK)
			{
				#if APPLICATION_LOG_LEVEL == 1
					debug_out("got __BLANK line\r\n");
				#endif
			}
			else
			{
				#if APPLICATION_LOG_LEVEL == 1
					debug_out("expected __BLANK line, got something else\r\n");
				#endif
			}

			// Read 2nd line
			len = uart3_readline();
			debug_out(uart3_fifo.line);

			resp = process_response(uart3_fifo.line,len);

			if(resp == __LINE_OTHER)
			{
				if(strstr(uart3_fifo.line, "SEND OK"))
				{
					flag = 1;
				}
			}
		}
		else
		{
			// ERROR
			return flag;
		}
	}
	else
	{
		// ERROR
		return flag;
	}
	return flag;
}

int jsoneq(const char *json, jsmntok_t *tok, const char *s) {
	if (tok->type == JSMN_STRING && (int) strlen(s) == tok->end - tok->start &&
			strncmp(json + tok->start, s, tok->end - tok->start) == 0) {
		return 0;
	}
	return -1;
}